---
kind: method
id: M:Autodesk.Revit.DB.DisplacementElement.SetRelativeDisplacement(Autodesk.Revit.DB.XYZ)
source: html/8f1c4d35-4642-25de-7509-8f7917267186.htm
---
# Autodesk.Revit.DB.DisplacementElement.SetRelativeDisplacement Method

Sets the relative displacement applied to the displaced elements by this DisplacementElement.

## Syntax (C#)
```csharp
public void SetRelativeDisplacement(
	XYZ displacement
)
```

## Parameters
- **displacement** (`Autodesk.Revit.DB.XYZ`) - The relative displacement.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null